In [2]:
import pandas as pd
df = pd.DataFrame({
    "one" : {"I":1,"II":2,"III":3},
    "two" : {"II":2.0,"III":3.0,"I":1.0}
})
df

     one  two
I      1  1.0
II     2  2.0
III    3  3.0

In [3]:
df-1

     one  two
I      0  0.0
II     1  1.0
III    2  2.0

In [26]:
df-df.iloc[0]

     one  two
I    0.0  0.0
II   1.0  1.0
III  2.0  2.0

In [27]:
1/df

          one       two
I    1.000000  1.000000
II   0.500000  0.500000
III  0.333333  0.333333

In [28]:
df**2

     one  two
I      1  1.0
II     4  4.0
III    9  9.0

In [29]:
-df

     one  two
I     -1 -1.0
II    -2 -2.0
III   -3 -3.0

In [31]:
df.T

       I   II  III
one  1.0  2.0  3.0
two  1.0  2.0  3.0

In [32]:
df.to_string()

'     one  two\nI      1  1.0\nII     2  2.0\nIII    3  3.0'